INSERT INTO Facture (name, date, montant, status, id_user)
VALUES
    (' فاتورةالماء', '2024-05-01', 150.00, 'Paid', 1),
    ('فاتورة الكهرباء والغاز' ,'2024-05-01', 200.00, 'Paid', 1),
    ('فاتورة الهاتف', '2024-05-01', 50.00, 'Paid', 1),
    ('فاتورة الانترنت', '2024-05-01', 80.00, 'Paid', 1),
    ('فاتورة الكهرباء والغاز', '2024-05-01', 200.00, 'Paid', 2),
    ('فاتورة الهاتف', '2024-05-01', 50.00, 'Paid', 2),
    ('فاتورة الانترنت', '2024-05-01', 80.00, 'Paid', 2),
    ('فاتورة الكهرباء والغاز', '2024-05-01', 200.00, 'pending', 1),
    ('فاتورة الهاتف', '2024-05-01', 50.00, 'pending', 1),
    ('فاتورة الانترنت', '2024-05-01', 80.00, 'pending', 1),
    ('فاتورة الكهرباء والغاز', '2024-05-01', 200.00, 'pending', 1),
    ('فاتورة الهاتف', '2024-05-01', 50.00, 'Paid', 1),
    ('فاتورة الانترنت', '2024-05-01', 80.00, 'Paid', 3),
    ('فاتورة الكهرباء والغاز', '2024-05-01', 200.00, 'Paid', 3),
    ('فاتورة الهاتف', '2024-05-01', 50.00, 'Paid', 5),
    ('فاتورة الانترنت', '2024-05-01', 80.00, 'Paid', 5),
    ('فاتورة الكهرباء والغاز', '2024-05-01', 200.00, 'Paid', 4),
    ('فاتورة الهاتف', '2024-05-01', 50.00, 'Paid', 4),
    ('فاتورة الانترنت', '2024-05-01', 80.00, 'Paid', 4);

    -- comment
    
    INSERT INTO Facture (name, date, montant, status, id_user)
VALUES
    (' فاتورةالماء', '2024-05-01', 150.00, 'Paid', 6),
    ('فاتورة الكهرباء والغاز' ,'2024-05-01', 200.00, 'Paid', 6),
    ('فاتورة الهاتف', '2024-05-01', 50.00, 'Paid', 6),
    ('فاتورة الانترنت', '2024-05-01', 80.00, 'Paid', 6),
    ('فاتورة الكهرباء والغاز', '2024-05-01', 200.00, 'Paid', 6),
    ('فاتورة الهاتف', '2024-05-01', 50.00, 'Paid', 6),
    ('فاتورة الانترنت', '2024-05-01', 80.00, 'Paid', 6),
    ('فاتورة الكهرباء والغاز', '2024-05-01', 200.00, 'pending', 6),
    ('فاتورة الهاتف', '2024-05-01', 50.00, 'pending', 6),
    ('فاتورة الانترنت', '2024-05-01', 80.00, 'pending', 6),
    ('فاتورة الكهرباء والغاز', '2024-05-01', 200.00, 'pending', 6),

    ALTER DATABASE facture_db
    CHARACTER SET utf8mb4
    COLLATE utf8mb4_unicode_ci;



  insert into compte(id_user,solde,numero,cvv,date_expiration,nom) values(1,10000,'11045070',4040,'2024-05-01',"abbas abbas");